Autodesk.Revit.DB.SKPImportOptions.#ctor(Autodesk.Revit.DB.SKPImportOptions)
Constructs a new instance of SKPImportOptions as a copy of the import options.
option:
The SKP options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.SKPImportOptions.#ctor
Constructs a new instance of SKPImportOptions with default values of all properties.
Since:
2014

Autodesk.Revit.DB.SKPImportOptions
The import options used to import SKP format files.
Since:
2014